 Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
		МенеджерЗаписи = РегистрыСведений.ВКМ_АбонентскаяПлата.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ДоговорКонтрагента = ЭтотОбъект.Ссылка;	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Прочитать();
	
	Если НЕ МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.ДоговорКонтрагента = ЭтотОбъект.Ссылка;
		МенеджерЗаписи.Период = ТекущаяДата();
		МенеджерЗаписи.СуммаАбонентскойПлаты = ВКМ_СуммаАбонентскойПлаты;
		МенеджерЗаписи.СтоимостьЧасаРаботы = ВКМ_СтоимостьЧасаРаботы;
		МенеджерЗаписи.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры


