#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ВКМ_ПланФактОтпусков Приход
	Движения.ВКМ_ПланФактОтпусков.Записывать = Истина;
	Для Каждого ТекСтрокаВКМ_ОтпускаСотрудников Из ВКМ_ОтпускаСотрудников Цикл
		Движение = Движения.ВКМ_ПланФактОтпусков.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_Сотрудник;
		Движение.ДатаНачала = ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_ДатаНачала;
		Движение.ДатаОкончания = ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_ДатаОкончания;
		Движение.ДлительностьПлан = ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_Длительность;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
#КонецЕсли

