#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВКМ_СоздатьАкты(Команда) 
	
	Если НЕ ЗначениеЗаполнено(Объект.ВКМ_Период) 
		ИЛИ НЕ ЗначениеЗаполнено(Объект.ВКМ_Период.ДатаНачала) Тогда
		ПоказатьПредупреждение(, "Укажите период!");
		Возврат;
	КонецЕсли;	
	
	Результат = МассовоеСозданиеНаСервере(Объект.ВКМ_Период);
	ЗаполнитьРезультат(Результат);
	ПоказатьПредупреждение(, "Готово! Создано: " + Результат.Количество() + " документов.");
КонецПроцедуры

&НаСервере
Функция МассовоеСозданиеНаСервере(Период)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.МассовоеСоздание(Период);
КонецФункции

&НаСервере
Процедура ЗаполнитьРезультат(Результат)
	Объект.ВКМ_Результат.Очистить();
	Для Каждого Строка Из Результат Цикл
		ЗаполнитьЗначенияСвойств(Объект.ВКМ_Результат.Добавить(), Строка);
	КонецЦикла;
КонецПроцедуры 
 
 #КонецОбласти

 