#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВКМ_ДиаграммаГанта.Очистить();
	
	Адрес = Параметры.АдресВХранилище;
	ОтпускаСотрудников = ПолучитьИзВременногоХранилища(Адрес);
	СерияОтпуск = ВКМ_ДиаграммаГанта.Серии.Добавить();
	СерияОтпуск.Текст = "Отпуск";
	СерияОтпуск.Цвет = Новый Цвет(100, 149, 237); 
	Для Каждого Строка Из ОтпускаСотрудников Цикл

		Точка = ВКМ_ДиаграммаГанта.УстановитьТочку(Строка.ВКМ_Сотрудник);
		Точка.Текст = Строка.ВКМ_Сотрудник;
		Значение = ВКМ_ДиаграммаГанта.ПолучитьЗначение(Точка, СерияОтпуск);
		Значение.Редактирование = Истина;

		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ВКМ_ДатаНачала;
		Интервал.Конец = Строка.ВКМ_ДатаОкончания;
		Интервал.Текст = "Отпуск";
		
	КонецЦикла;
	ЭлементШкалыМесяц = ВКМ_ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
	ЭлементШкалыМесяц.Единица = ТипЕдиницыШкалыВремени.Месяц;
	ЭлементШкалыМесяц.Формат = "ДФ = 'MMMM yyyy'";

	ЭлементШкалыДень = ВКМ_ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
	ЭлементШкалыДень.Единица = ТипЕдиницыШкалыВремени.День;
	ЭлементШкалыДень.Формат = "ДФ = 'dd'";
	
	Шкала = ВКМ_ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы[ВКМ_ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы.Количество() - 1];
	
	МеткаВремени = Шкала.Метки.Добавить(НачалоДня(ТекущаяДата()));
	МеткаВремени.Текст = "Текущая дата " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	МеткаВремени.ЦветТекста = WebЦвета.Красный;				
	МеткаВремени.ЦветЛинии = WebЦвета.Красный;
	ТекущийПериод = НачалоМесяца(ВКМ_ДиаграммаГанта.НачалоПолногоИнтервала - 1);
	КонечныйПериода = ВКМ_ДиаграммаГанта.КонецПолногоИнтервала;
	
	Пока ТекущийПериод < КонечныйПериода Цикл 
		Если КонецНедели(ТекущийПериод) = КонецДня(ТекущийПериод) Тогда 
			ИнтервалФона = ВКМ_ДиаграммаГанта.ИнтервалыФона.Добавить(НачалоДня(ТекущийПериод - 86400), КонецДня(ТекущийПериод));
			ИнтервалФона.Цвет = WebЦвета.БледноЛиловый;
		КонецЕсли;
		
		ТекущийПериод = КонецДня(ТекущийПериод) + 1;	
	КонецЦикла;
	
	Для Каждого Точка Из ВКМ_ДиаграммаГанта.Точки Цикл
		ВКМ_ДиаграммаГанта.РазвернутьТочку(Точка, Истина);
	КонецЦикла;
	
КонецПроцедуры 

#КонецОбласти
