
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

КонецПроцедуры

Процедура ВыполнитьАвтозаполнение() Экспорт
	
	//++Горячева Добавление Команды
	НоменклатураАП = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	НоменклатураРаботаСпец = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	
	Если НоменклатураАП = Неопределено ИЛИ НоменклатураРаботаСпец = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст ="Не заполнены константы Номенклатура Абонентская Плата или Номенклатура работы специалиста";
		Сообщение.Сообщить();
		Возврат; 	
	КонецЕсли;
	
	Если Договор = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Услуги.Очистить();
	
	СуммаАП = 0;//данные заполняем из регистра сведений ВКМ_АП
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_АбонентскаяПлатаСрезПоследних.СуммаАбонентскойПлаты КАК СуммаАбонентскойПлаты
		|ИЗ
		|	РегистрСведений.ВКМ_АбонентскаяПлата.СрезПоследних(&Период, ДоговорКонтрагента = &Договор) КАК
		|		ВКМ_АбонентскаяПлатаСрезПоследних";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СуммаАП = ВыборкаДетальныеЗаписи.СуммаАбонентскойПлаты;
		Если СуммаАП > 0 Тогда
			СтрокаУслуги = Услуги.Добавить();
			СтрокаУслуги.Номенклатура = НоменклатураАП;
			СтрокаУслуги.Количество = 1;
			СтрокаУслуги.Цена = СуммаАП;
			СтрокаУслуги.Сумма = СуммаАП * СтрокаУслуги.Количество;
		КонецЕсли;
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовОборот), 0) КАК ВсегоЧасов,
		|	ЕСТЬNULL(СУММА(ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот), 0) КАК СуммаКОплате
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&НачалоМесяца, &КонецМесяца, , Договор = &Договор) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты";
	
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.СуммаКОплате > 0 Тогда
			СтрокаУслуги = Услуги.Добавить();
			СтрокаУслуги.Номенклатура = НоменклатураРаботаСпец;
			СтрокаУслуги.Количество = ВыборкаДетальныеЗаписи.ВсегоЧасов;
			Если ВыборкаДетальныеЗаписи.ВсегоЧасов > 0 Тогда
				СтрокаУслуги.Цена = ВыборкаДетальныеЗаписи.СуммаКОплате / ВыборкаДетальныеЗаписи.ВсегоЧасов;
			Иначе
				СтрокаУслуги.Цена = 0;
				СтрокаУслуги.Сумма = ВыборкаДетальныеЗаписи.СуммаКОплате;
				СтрокаУслуги.Количество = 1;
			КонецЕсли;
		КонецЕсли;	
				
	КонецЦикла;
		СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	//--Горячева Добавление Команды
КонецПроцедуры	

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	//++Горячева испр.опечатки
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока УслугиОснования.Следующий() Цикл
	//--Горячева испр.опечатки
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	//++Горячева дополнение процедуры
	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	//--Горячева дополнение процедуры
КонецПроцедуры

#КонецОбласти

#КонецЕсли
