#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	СформироватьДвиженияОсновныеНачисления();
	РассчитатьОкладПоДаннымГрафика();
	РассчитатьОтпускные();
	РассчитатьПроцентСпециалистам();
	РассчитатьНДФЛИУдержания();
	Движения.Записать();
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвиженияОсновныеНачисления()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_НачислениеЗаработнойПлатыВКМ_Начисления.ВКМ_Сотрудник КАК Сотрудник,
	|	ВКМ_НачислениеЗаработнойПлатыВКМ_Начисления.ВКМ_ВидРасчета КАК ВидРасчета,
	|	ВКМ_НачислениеЗаработнойПлатыВКМ_Начисления.ВКМ_ДатаНачала КАК ДатаНачала,
	|	ВКМ_НачислениеЗаработнойПлатыВКМ_Начисления.ВКМ_ДатаОкончания КАК ДатаОкончания,
	|	ВКМ_НачислениеЗаработнойПлатыВКМ_Начисления.ВКМ_ГрафикРаботы КАК ГрафикРаботы,
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад, 0) КАК Оклад
	|ИЗ
	|	Документ.ВКМ_НачислениеЗаработнойПлаты.ВКМ_Начисления КАК ВКМ_НачислениеЗаработнойПлатыВКМ_Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|		ПО ВКМ_НачислениеЗаработнойПлатыВКМ_Начисления.ВКМ_Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
	|ГДЕ
	|	ВКМ_НачислениеЗаработнойПлатыВКМ_Начисления.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", КонецМесяца(Дата));
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = ВыборкаДетальныеЗаписи.ДатаНачала;
		Движение.ПериодДействияКонец = ВыборкаДетальныеЗаписи.ДатаОкончания;
		Движение.ВидРасчета = ВыборкаДетальныеЗаписи.ВидРасчета;
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Движение.ГрафикРаботы = ВыборкаДетальныеЗаписи.ГрафикРаботы;	
		// Для оклада — ставим полный оклад
		Если ВыборкаДетальныеЗаписи.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
			Движение.Результат = ВыборкаДетальныеЗаписи.Оклад;
		Иначе
			Движение.Результат = 0; // Для отпуска рассчитаем отдельно
		КонецЕсли;	
	КонецЦикла;	
	Движения.ВКМ_ОсновныеНачисления.Записать();
КонецПроцедуры

Процедура РассчитатьОкладПоДаннымГрафика()	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|   ДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|   ДанныеГрафика.ЗначениеПериодДействия КАК НормаЧасов,
	|   ДанныеГрафика.Сотрудник КАК Сотрудник,
	|   ДанныеГрафика.ПериодДействияНачало КАК НачалоПериода,
	|   ДанныеГрафика.ПериодДействияКонец КАК КонецПериода,
	|   ДанныеГрафика.Результат КАК ПолныйОклад
	|ИЗ
	|   РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка
	|   И ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Оклад)) КАК ДанныеГрафика";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		НачалоПериода = ВыборкаДетальныеЗаписи.НачалоПериода;
		КонецПериода = ВыборкаДетальныеЗаписи.КонецПериода;
		НормаЧасов = ВыборкаДетальныеЗаписи.НормаЧасов;
		НормаДней = НормаЧасов / 8;
		ПолныйОклад = ВыборкаДетальныеЗаписи.ПолныйОклад;
		
		// все отпуска сотрудника
		ЗапросОтпуск = Новый Запрос;
		ЗапросОтпуск.Текст = 
		"ВЫБРАТЬ
		|   Отпуск.ПериодДействияНачало КАК НачалоОтпуска,
		|   Отпуск.ПериодДействияКонец КАК КонецОтпуска
		|ИЗ
		|   РегистрРасчета.ВКМ_ОсновныеНачисления КАК Отпуск
		|ГДЕ
		|   Отпуск.Регистратор = &Ссылка
		|   И Отпуск.Сотрудник = &Сотрудник
		|   И Отпуск.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск)";
		
		ЗапросОтпуск.УстановитьПараметр("Ссылка", Ссылка);
		ЗапросОтпуск.УстановитьПараметр("Сотрудник", Сотрудник);
		
		ВыборкаОтпуск = ЗапросОтпуск.Выполнить().Выбрать();
		ДнейОтпуска = 0;
		Пока ВыборкаОтпуск.Следующий() Цикл	
			НачалоОтпуска = ВыборкаОтпуск.НачалоОтпуска;
			КонецОтпуска = ВыборкаОтпуск.КонецОтпуска;
			// Проверяем пересечение оклада и отпуска
			Если Не (КонецОтпуска < НачалоПериода Или НачалоОтпуска > КонецПериода) Тогда
				ДеньНачала = Макс(НачалоОтпуска, НачалоПериода);
				ДеньОкончания = Мин(КонецОтпуска, КонецПериода);
				ДнейВОтпуске = (ДеньОкончания - ДеньНачала) / (60 * 60 * 24) + 1;
				ДнейОтпуска = ДнейОтпуска + ДнейВОтпуске;	
			КонецЕсли;	
		КонецЦикла;
		
		//рабочие дни
		РабочихДнейФакт = НормаДней - ДнейОтпуска;
		Движение = Движения.ВКМ_ОсновныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
		Если НормаДней <> 0 Тогда
			Движение.Результат = ПолныйОклад * РабочихДнейФакт / НормаДней;
		Иначе
			Движение.Результат = 0;
		КонецЕсли;
		Движение.ОтработаноЧасов = РабочихДнейФакт * 8;		
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
	
КонецПроцедуры

Процедура РассчитатьОтпускные()
	//  Базу за 12 месяцев для каждого сотрудника
	ЗапросБаза = Новый Запрос;
	ЗапросБаза.Текст = 
	"ВЫБРАТЬ
	|   ОсновныеНачисления.Сотрудник КАК Сотрудник,
	|   СУММА(ОсновныеНачисления.Результат) КАК СуммаБазы,
	|   СУММА(ОсновныеНачисления.ОтработаноЧасов) КАК ЧасыБазы
	|ИЗ
	|   РегистрРасчета.ВКМ_ОсновныеНачисления КАК ОсновныеНачисления
	|ГДЕ
	|   ОсновныеНачисления.Сотрудник В
	|       (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|           Отпуск.Сотрудник
	|       ИЗ
	|           РегистрРасчета.ВКМ_ОсновныеНачисления КАК Отпуск
	|       ГДЕ
	|           Отпуск.Регистратор = &Ссылка
	|           И Отпуск.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск))
	|   И ОсновныеНачисления.ВидРасчета <> ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск)
	|   И ОсновныеНачисления.ПериодРегистрации МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|   ОсновныеНачисления.Сотрудник";
	
	ЗапросБаза.УстановитьПараметр("Ссылка", Ссылка);
	ЗапросБаза.УстановитьПараметр("НачалоПериода", НачалоМесяца(ДобавитьМесяц(Дата, -12)));
	ЗапросБаза.УстановитьПараметр("КонецПериода", КонецМесяца(ДобавитьМесяц(Дата, -1)));
	
	ТаблицаБазы = ЗапросБаза.Выполнить().Выгрузить();
	
	//  Дни отпуска из ДанныеГрафика
	ЗапросДни = Новый Запрос;
	ЗапросДни.Текст = 
	"ВЫБРАТЬ
	|   ДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|   ДанныеГрафика.Сотрудник КАК Сотрудник,
	|   ДанныеГрафика.ЗначениеФактическийПериодДействия КАК ДниОтпуска
	|ИЗ
	|   РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
	|       Регистратор = &Ссылка
	|           И ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск)
	|   ) КАК ДанныеГрафика";
	
	ЗапросДни.УстановитьПараметр("Ссылка", Ссылка);
	
	ВыборкаДетальныеЗаписи = ЗапросДни.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НомерСтроки = ВыборкаДетальныеЗаписи.НомерСтроки;
		Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		ДниОтпуска = ВыборкаДетальныеЗаписи.ДниОтпуска;
		//  Ищем базу для этого сотрудника
		СтрокаБазы = ТаблицаБазы.Найти(Сотрудник, "Сотрудник");
		
		Если СтрокаБазы <> Неопределено Тогда
			СуммаБазы = СтрокаБазы.СуммаБазы;
			ЧасыБазы = СтрокаБазы.ЧасыБазы;
		Иначе
			СуммаБазы = 0;
			ЧасыБазы = 0;
		КонецЕсли;
		Движение = Движения.ВКМ_ОсновныеНачисления[НомерСтроки - 1];
		
		Если ЧасыБазы = 0 Тогда
			Движение.Результат = 0;
		Иначе
			//(База / ЧасыБазы) × 8 × ДниОтпуска
			Движение.Результат = СуммаБазы / ЧасыБазы * 8 * ДниОтпуска;
		КонецЕсли;
		
	КонецЦикла;
	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
	
КонецПроцедуры

Процедура РассчитатьПроцентСпециалистам()
	
	//  Получаем процент для специалистов из РС ВыполненныеСотрудникомРаботы
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|   УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|   УсловияОплатыСотрудниковСрезПоследних.ПроцентПремии КАК ПроцентПремии,
	|   СУММА(ЕСТЬNULL(ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеОборот, 0)) КАК СуммаКОплате
	|ИЗ
	|   РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, ) КАК УсловияОплатыСотрудниковСрезПоследних
	|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(
	|               &НачалоПериода,
	|               &КонецПериода,
	|               ,
	|               ) КАК ВыполненныеСотрудникомРаботыОбороты
	|       ПО УсловияОплатыСотрудниковСрезПоследних.Сотрудник = ВыполненныеСотрудникомРаботыОбороты.Сотрудник
	|ГДЕ
	|   УсловияОплатыСотрудниковСрезПоследних.ПроцентПремии <> НЕОПРЕДЕЛЕНО
	|
	|СГРУППИРОВАТЬ ПО
	|   УсловияОплатыСотрудниковСрезПоследних.Сотрудник,
	|   УсловияОплатыСотрудниковСрезПоследних.ПроцентПремии";
	
	Запрос.УстановитьПараметр("Период", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		ПроцентПремии = ВыборкаДетальныеЗаписи.ПроцентПремии;
		СуммаКОплате = ВыборкаДетальныеЗаписи.СуммаКОплате;
		
		СуммаПроцента = СуммаКОплате * ПроцентПремии / 100;
		Для Каждого СтрокаДокумента Из ВКМ_Начисления Цикл
			Если СтрокаДокумента.ВКМ_Сотрудник = Сотрудник 
				И СтрокаДокумента.ВКМ_ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
				
				// Создаем движение по РР доп начисления
				ДвижениеДоп = Движения.ВКМ_ДополнительныеНачисления.Добавить();
				ДвижениеДоп.ПериодРегистрации = НачалоМесяца(Дата);
				ДвижениеДоп.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
				ДвижениеДоп.Сотрудник = Сотрудник;
				ДвижениеДоп.Результат = СуммаПроцента;
				СтрокаДокумента.ВКМ_ДополнительныеНачисления = СуммаПроцента;
				Прервать; 
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	Движения.ВКМ_ДополнительныеНачисления.Записать();
КонецПроцедуры

Процедура РассчитатьНДФЛИУдержания()
	
	//сбор всех начислений по сотрудникам 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|   ОсновныеНачисления.Сотрудник КАК Сотрудник,
	|   СУММА(ОсновныеНачисления.Результат) КАК СуммаОсновных,
	|   СУММА(ДополнительныеНачисления.Результат) КАК СуммаДополнительных
	|ИЗ
	|   РегистрРасчета.ВКМ_ОсновныеНачисления КАК ОсновныеНачисления
	|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ДополнительныеНачисления
	|       ПО ОсновныеНачисления.Сотрудник = ДополнительныеНачисления.Сотрудник
	|           И ОсновныеНачисления.Регистратор = ДополнительныеНачисления.Регистратор
	|ГДЕ
	|   ОсновныеНачисления.Регистратор = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|   ОсновныеНачисления.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		СуммаОсновных = ВыборкаДетальныеЗаписи.СуммаОсновных;
		СуммаДополнительных = ВыборкаДетальныеЗаписи.СуммаДополнительных;
		
		// База НДФЛ = основные + дополнительные
		СуммаБаза = СуммаОсновных + СуммаДополнительных;
		СуммаНДФЛ = ВКМ_РасчетНДФЛ.РассчитатьНДФЛ(СуммаБаза);
		
		// РР Удержание
		ДвижениеУдерж = Движения.ВКМ_Удержания.Добавить();
		ДвижениеУдерж.ПериодРегистрации = НачалоМесяца(Дата);
		ДвижениеУдерж.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		ДвижениеУдерж.Сотрудник = Сотрудник;
		ДвижениеУдерж.Результат = СуммаНДФЛ;
		
		// РН Взаимозачеты
		СуммаКВыплате = СуммаБаза - СуммаНДФЛ;
		ДвижениеВзаим = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		ДвижениеВзаим.Период = Дата;
		ДвижениеВзаим.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеВзаим.Сотрудник = Сотрудник;
		ДвижениеВзаим.Сумма = СуммаКВыплате;
		
	КонецЦикла;
	Движения.ВКМ_Удержания.Записать();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
КонецПроцедуры

#КонецОбласти
#КонецЕсли
