#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

 Процедура ОбработкаПроведения(Отказ, Режим)
	 
	 // РН Взаиморасчеты
	 Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	 Для Каждого Строка Из ВКМ_Выплаты Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Сотрудник = Строка.ВКМ_Сотрудник;
		Движение.Сумма = Строка.ВКМ_Сумма;
	КонецЦикла;
	Движения.Записать();

КонецПроцедуры 

#КонецОбласти
#КонецЕсли
