 
 Функция МассовоеСоздание(Период) Экспорт
	 ОбработанныеДокументы = Новый Массив;
	 
	 Если ТипЗнч(Период) = Тип("СтандартныйПериод") Тогда 
		 НачалоПериода = НачалоМесяца(Период.ДатаНачала);
		 КонецПериода = КонецМесяца(Период.ДатаОкончания);
	 Иначе
		 НачалоПериода = НачалоМесяца(Период);
		 КонецПериода = КонецМесяца(Период);
	 КонецЕсли;
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ДоговорыКонтрагентов.Ссылка КАК Договор,
	 |	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	 |	ДоговорыКонтрагентов.Организация КАК Организация,
	 |	ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка) КАК Реализация
	 |ИЗ
	 |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	 |ГДЕ
	 |	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора";
	 
	 Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
	 Выборка = Запрос.Выполнить().Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
		 ЗапросПроверки = Новый Запрос;
		 ЗапросПроверки.Текст = 
		 "ВЫБРАТЬ
		 |   РеализацияТоваровУслуг.Ссылка КАК Реализация
		 |ИЗ
		 |   Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		 |ГДЕ
		 |   РеализацияТоваровУслуг.Договор = &Договор
		 |   И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		 |   И РеализацияТоваровУслуг.Проведен
		 |   И НЕ РеализацияТоваровУслуг.ПометкаУдаления";
		 
		 ЗапросПроверки.УстановитьПараметр("Договор", Выборка.Договор);
		 ЗапросПроверки.УстановитьПараметр("НачалоПериода", НачалоПериода);
		 ЗапросПроверки.УстановитьПараметр("КонецПериода", КонецПериода);
		 
		 РезультатПроверки = ЗапросПроверки.Выполнить().Выбрать();
		 Если РезультатПроверки.Следующий() Тогда
			 Сообщить("Акт создан ранее, отмена операции" + РезультатПроверки.Реализация);
			 ОбработанныеДокументы.Добавить(Новый Структура("ВКМ_Договор, ВКМ_Реализация, ВКМ_Статус, ВКМ_Комментарий", 
			 Выборка.Договор, РезультатПроверки.Реализация, "Отказ", "Акт создан ранее"));
			 Продолжить;
		 КонецЕсли;
		 ТекущийДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		 ТекущийДокумент.Дата = КонецМесяца(Период.ДатаОкончания);
		 ТекущийДокумент.Контрагент = Выборка.Контрагент;
		 ТекущийДокумент.Договор = Выборка.Договор;
		 ТекущийДокумент.Организация = Выборка.Организация;
		  Попытка
			 ТекущийДокумент.ВыполнитьАвтозаполнение(); 
			 ТекущийДокумент.СуммаДокумента = ТекущийДокумент.Товары.Итог("Сумма") + ТекущийДокумент.Услуги.Итог("Сумма");
			 
			 ТекущийДокумент.Записать(РежимЗаписиДокумента.Проведение);
			 ОбработанныеДокументы.Добавить(Новый Структура("ВКМ_Договор, ВКМ_Реализация, ВКМ_Статус, ВКМ_Комментарий", 
			 Выборка.Договор, ТекущийДокумент.Ссылка, "Создано",""));
		 Исключение
			 ОбработанныеДокументы.Добавить(Новый Структура("ВКМ_Договор, ВКМ_Реализация, ВКМ_Статус, ВКМ_Комментарий", 
			 Выборка.Договор, Неопределено, "Ошибка", КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
		 КонецПопытки;
	 КонецЦикла; 
	 Возврат ОбработанныеДокументы;
 КонецФункции
