#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПериодРегистрации = НачалоМесяца(Дата);
	
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_Удержания.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Отказ = Ложь;
	
	Для Каждого Строка Из ВКМ_СписокСотрудников Цикл
		
		// проверка типа оплаты. 
		Если Не ПроверитьПолучаютФиксПремию(Строка.ВКМ_Сотрудник, ПериодРегистрации) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Сотрудник %1 не получает фиксированную премию. Документ не проведен.", 
										Строка.ВКМ_Сотрудник);
			Сообщение.Сообщить();
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
		
		// РР ДополнительныеНачисления 
		ДвижениеДоп = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		ДвижениеДоп.ПериодРегистрации = ПериодРегистрации;
		ДвижениеДоп.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
		ДвижениеДоп.Сотрудник = Строка.ВКМ_Сотрудник;
		ДвижениеДоп.Результат = Строка.ВКМ_СуммаПремии;
		
		// НДФЛ из ОМ
		Строка.ВКМ_СуммаНДФЛ = ВКМ_РасчетНДФЛ.РассчитатьНДФЛ(Строка.ВКМ_СуммаПремии);
		
		// РР Удержания 
		ДвижениеУдержание= Движения.ВКМ_Удержания.Добавить();
		ДвижениеУдержание.ПериодРегистрации = ПериодРегистрации;
		ДвижениеУдержание.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		ДвижениеУдержание.Сотрудник = Строка.ВКМ_Сотрудник;
		ДвижениеУдержание.Результат = Строка.ВКМ_СуммаНДФЛ;
		
		// РН Взаиморасчеты 
		СуммаКВыплате = Строка.ВКМ_СуммаПремии - Строка.ВКМ_СуммаНДФЛ;
		ДвижениеВзаим = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		ДвижениеВзаим.Период = Дата;
		ДвижениеВзаим.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеВзаим.Сотрудник = Строка.ВКМ_Сотрудник;
		ДвижениеВзаим.Сумма = СуммаКВыплате;
	КонецЦикла;
	
	Если Отказ Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Проведение документа отменено";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Движения.Записать();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроверитьПолучаютФиксПремию(Сотрудник, Период)
	
	// Если в РС ВКМ_УсловияОплатыСотрудников ПроцентПремии > ИЛИ = 0 Тогда премия от вып.работ
	// Иначе ПроцентПремии не заполнен Тогда фиксированная премия 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентПремии КАК ПроцентПремии
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, ) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|ГДЕ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПроцентПремии)
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
#КонецЕсли























